chgpalmer/nrf9151-tracker/apps/tracker/src/main.c
	err = nrf_modem_lib_init();
	if (err) {
		LOG_ERR("modem init: %d", err);
		return err;
	}

	/* Device identity: IMEI on hardware, env/Kconfig on native_sim */
	err = hw_id_get(device_id, sizeof(device_id));
	if (err) {
		LOG_ERR("hw_id_get: %d", err);
		return err;
	}
	LOG_INF("device id: %s", device_id);
	LOG_INF("server: coap://%s:%d/obs", SERVER_HOST, SERVER_PORT);
	/* Uplink owns the envelope + flush policy; obs store and the log ring
	 * register as its sources. GPS samples land at the publish interval —
	 * a track segment's time model (anchor + i*dt) is built on it. */
	uplink_init(device_id);
	uplink_on_sent(on_uplink_sent);
	obs_queue_init(POST_INTERVAL_MS);
	log_uplink_init();
	agnss_set_device_id(device_id);
	leds_init();

	/* Start LTE async — don't block, status loop shows progress */
	LOG_INF("starting LTE (async)...");
	err = lte_lc_connect_async(lte_handler);
	if (err) {
		LOG_ERR("lte_lc_connect_async: %d", err);
		return err;
	}

#if defined(CONFIG_LTE_LC_PDN_MODULE)
	/* Default-context PDN events tell us when the IP is actually up,
	 * not just when we've registered. */
	err = lte_lc_pdn_default_ctx_events_enable();
	if (err) {
		LOG_WRN("pdn events enable: %d", err);
	}
#endif

	/* Configure GNSS but do NOT start it yet. An unregistered modem runs a
	 * continuous cell search; GNSS running against that starves the search and
	 * gains nothing itself. loc_fsm starts it once LTE has registered. */
	err = gnss_configure();
	if (err) {
		LOG_ERR("gnss configure: %d", err);
		return err;
	}
	/* The GNSS mode actually applied to the modem. Reconfiguring requires a
	 * stop/set/start cycle; a failed start leaves this at OFF so the next
	 * loop pass retries rather than latching a wrong mode. */
	enum loc_gnss_mode gnss_mode_applied = LOC_GNSS_OFF;
	uint16_t gnss_interval_applied = 0;
	bool gnss_blocked_prev = false;
	/* lte_lc_connect_async() below turns the stack on; GNSS_EXCLUSIVE is the
	 * only thing that turns it off. */
	bool lte_stack_on = true;
	/* Snapshot of the most recent PVT frame with FIX_VALID set. The live `pvt`
	 * global only carries defined lat/lon while the flag is set, but the FSM
	 * lets us publish for up to GPS_STALE_S after the fix lapses -- those
	 * publishes must come from this copy, not from whatever an unfixed frame
	 * happens to contain. (static: ~700 B, keep off the main stack) */
	static struct nrf_modem_gnss_pvt_data_frame fix_pvt;
	int64_t fix_pvt_ms = 0; /* when fix_pvt was captured, for the age field */

	int64_t last_post_ms   = 0;
	int64_t queued_fix_ms  = 0;
	int64_t last_acq_log_ms = 0;
	int64_t last_status_ms = 0;
	int64_t next_net_ms    = 0;
	enum loc_state prev_state = LOC_LTE_ATTACH;
	struct loc_status loc;

	loc_fsm_init(k_uptime_get());
	motion_init(k_uptime_get());

	for (;;) {
		/* Wait for next PVT event (1 Hz) with a 2s timeout so the
		 * status block still prints even if GNSS is blocked by LTE. */
		k_sem_take(&pvt_sem, K_SECONDS(2));

		int64_t now = k_uptime_get();

		if (pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
			fix_pvt = pvt;
			fix_pvt_ms = now;
			motion_note_gps(pvt.latitude, pvt.longitude,
					(double)pvt.accuracy, now);
		}

		/* Policy first: it owns the fix-staleness and ephemeris bookkeeping. */
		loc_fsm_update(&pvt, now, lte_connected, motion_stationary(now),
			       &loc);
		leds_update(&loc, lte_connected);

		/* First parked entry of this boot: checkpoint the modem's NVM
		 * (see the block comment at checkpoint_enabled). CFUN=0 takes
		 * everything down — socket, registration, GNSS — so close the
		 * socket and force the GNSS mode to be reapplied; the FSM sees
		 * the registration drop and walks the normal re-attach path. */
		if (checkpoint_enabled && !checkpoint_done &&
		    (loc.state == LOC_QUIESCENT || loc.state == LOC_REST)) {
			checkpoint_done = true;
			LOG_INF("LTE: checkpoint — persisting network state "
				"(one re-attach)");
			coap_pub_close();
			(void)lte_lc_func_mode_set(LTE_LC_FUNC_MODE_POWER_OFF);
			(void)lte_lc_func_mode_set(LTE_LC_FUNC_MODE_NORMAL);
			gnss_mode_applied = LOC_GNSS_OFF;
		}

		/* Apply the FSM's GNSS mode. Runs GNSS only when the FSM says
		 * so (a searching modem owns the radio), and switches between
		 * continuous 1 Hz and the modem's periodic-navigation mode
		 * when the parked states ask for it. */
		if (loc.gnss_mode != gnss_mode_applied ||
		    (loc.gnss_mode == LOC_GNSS_PERIODIC &&
		     loc.gnss_interval_s != gnss_interval_applied)) {
			if (gnss_mode_applied != LOC_GNSS_OFF) {
				(void)nrf_modem_gnss_stop();
			}
			gnss_mode_applied = LOC_GNSS_OFF;
			if (loc.gnss_mode == LOC_GNSS_OFF) {
				LOG_INF("GNSS off (modem unregistered)");
			} else {
				bool cont = (loc.gnss_mode == LOC_GNSS_CONTINUOUS);
				uint16_t ivl = cont ? GNSS_INTERVAL_S
						    : loc.gnss_interval_s;

				nrf_modem_gnss_fix_interval_set(ivl);
				nrf_modem_gnss_fix_retry_set(
					cont ? 0 : GNSS_CHECK_RETRY_S);
				if (gnss_start() == 0) {
					LOG_INF("GNSS %s (interval %u s)",
						cont ? "continuous" : "periodic",
						ivl);
					gnss_mode_applied = loc.gnss_mode;
					gnss_interval_applied =
						loc.gnss_interval_s;
				} /* else: stays OFF, retried next pass */
			}
		}

		/* GNSS_EXCLUSIVE: take the LTE stack down entirely so idle-mode
		 * DRX/reselection can't slice GNSS; bring it back on exit. GNSS
		 * keeps running across both edges — DEACTIVATE_LTE leaves it be. */
		if (!loc.lte_wanted && lte_stack_on) {
			LOG_WRN("deactivating LTE — GNSS gets the radio outright");
			if (lte_lc_func_mode_set(LTE_LC_FUNC_MODE_DEACTIVATE_LTE) == 0) {
				lte_stack_on = false;
			}
			coap_pub_close(); /* socket dies with the PDN */
		} else if (loc.lte_wanted && !lte_stack_on) {
			LOG_INF("re-activating LTE (re-attach follows)");
			if (lte_lc_func_mode_set(LTE_LC_FUNC_MODE_ACTIVATE_LTE) == 0) {
				lte_stack_on = true;
			}
		}

		/* A PDN drop (deactivation or network-side) orphans the UDP socket;
		 * recreate it when the PDN returns rather than sending into a void. */
		if (!pdn_active && coap_pub_ready()) {
			LOG_WRN("PDN down — closing CoAP socket");
			coap_pub_close();
		}

