chgpalmer/nrf9151-tracker/apps/tracker/src/main.c
		/* Registration loss post-mortem: one CEER read per loss edge. */
		if (want_ceer) {
			want_ceer = false;
			char ceer[64];

			if (nrf_modem_at_cmd(ceer, sizeof(ceer), "AT+CEER") == 0) {
				char *nl = strpbrk(ceer, "\r\n");

				if (nl) {
					*nl = '\0';
				}
				LOG_INF("LTE lost: %s", ceer);
			}
		}

		/* EVT_BLOCKED/UNBLOCKED arrive in ISR context; log the edge here. */
		if (gnss_blocked != gnss_blocked_prev) {
			gnss_blocked_prev = gnss_blocked;
			LOG_DBG("GNSS: %s by LTE",
				gnss_blocked ? "blocked" : "unblocked");
		}

		/* One-time UDP socket setup, retried on failure. Needs LTE up (DNS
		 * goes over the PDN) and is gated on publish_allowed so even the
		 * getaddrinfo exchange stays out of GNSS quiet windows. There is no
		 * connection to keep alive: UDP is silent between sends by nature,
		 * which is the whole point of the CoAP move. Gated on pdn_active
		 * too: before the default PDN has an IP, getaddrinfo/socket can
		 * only fail. (Always true on native_sim.) */
		if (loc.publish_allowed && pdn_active &&
		    lte_connected && !coap_pub_ready() && now >= next_net_ms) {
			next_net_ms = now + NET_RETRY_MS;
			if (coap_pub_init(SERVER_HOST, SERVER_PORT)) {
				LOG_WRN("CoAP setup failed (retry in %d s)",
					NET_RETRY_MS / 1000);
			}
		}

		/* Acquisition forensics: while hunting (or waiting on a stale
		 * fix), ship one compact sky snapshot at INF every 30 s so a
		 * drive-time acquisition failure is diagnosable from the server
		 * — the per-satellite DBG table never leaves UART. Bounded:
		 * ~70 B/line only while unfixed, so a 5-min episode is ~700 B.
		 * ephe V/H: V of the H satellites we hold ephemeris for are
		 * currently visible; a fix needs 4 visible. */
		bool hunting = (loc.state == LOC_GNSS_ACQUIRE ||
				loc.state == LOC_GNSS_EXCLUSIVE ||
				(loc.state == LOC_REPORT_GNSS && !loc.gps_current));
		if (hunting && now - last_acq_log_ms >= 30000) {
			last_acq_log_ms = now;
			LOG_INF("acq: %s tracked %u strong %u ephe %u/%u empty %u pdop %.1f",
				loc_state_str(loc.state), loc.tracked, loc.strong,
				loc.ephemeris_visible, loc.ephemeris_held,
				loc.sky_empty, (double)loc.pdop);
		}

		/* Status block every STATUS_INTERVAL_MS */
		if (now - last_status_ms >= STATUS_INTERVAL_MS) {
			last_status_ms = now;
			print_status(&pvt, &loc, now);
		}

		/* SAMPLE at the FSM's cadence — free, no radio involved. GPS
		 * samples come from the fix-valid snapshot; within ~10 m of the
		 * previous point they queue as 4 B repeat entries. */
		if (loc.publish_allowed && now - last_post_ms >= loc.publish_interval_ms) {
			last_post_ms = now;
			if (!loc.prefer_cell) {
				/* Only if the snapshot is NEW: while LTE holds the
				 * radio GNSS produces no PVT, and re-queueing the
				 * same snapshot each interval shipped identical
				 * points 10x (seen in the server DB). */
				if (fix_pvt_ms != queued_fix_ms) {
					queued_fix_ms = fix_pvt_ms;
					obs_queue_add_gps(&fix_pvt, fix_pvt_ms);
				}
			} else if (lte_connected) {
				struct serving_cell sc;
				/* Condition, not event: don't repeat the WRN every
				 * cell interval while XMONITOR keeps failing. */
				static bool cell_unavail;

				if (read_serving_cell(&sc) == 0 && sc.valid) {
					cell_unavail = false;
					obs_queue_add_cell(sc.mcc, sc.mnc, sc.tac,
							   sc.cid, sc.rsrp_dbm, now);
					motion_note_cell(sc.cid, now);
				} else if (!cell_unavail) {
					cell_unavail = true;
					LOG_WRN("serving cell unavailable");
				}
			}
		}

		/* SHIP: uplink owns all flush policy (timer / fullness / urgent).
		 * We hand it the radio verdict and tick it; a state change is
		 * the one policy input only this loop can see (a fresh fix or
		 * boot cell report should reach the map now, not in 2 min). */
		if (loc.state != prev_state) {
			prev_state = loc.state;
			uplink_request_flush(UPLINK_FLUSH_URGENT);
		}
		/* Parked = slow flush timer. Keyed on the FSM state (not the
		 * raw verdict) so shipping only slows once actually quiesced;
		 * the QUIESCENT->REPORT_GNSS transition urgent-flushes above,
		 * so motion still reaches the map in seconds. */
		uplink_set_flush_interval(
			(loc.state == LOC_QUIESCENT || loc.state == LOC_REST)
			? (uint32_t)CONFIG_TRACKER_QUIESCENT_FLUSH_S * 1000
			: (uint32_t)CONFIG_TRACKER_FLUSH_INTERVAL_S * 1000);
		uplink_set_allowed(loc.publish_allowed);
		(void)uplink_poll(now);

		/* A-GNSS: opportunistic assistance fetch while the radio is
		 * already ours (never during acquisition silence or parked
		 * sleep — see agnss.c for the policy). */
		agnss_poll(now, &loc);
	}

	return 0;
}
